

class Messages {

  static String forgetPassword = 'مرحباً فريق نبض ..\nأنا الطالب ()، رقمي الجامعي ()، لقد نسيت كلمة السر من أجل الدخول إلى تطبيق نبض، يرجى تزويدي بها\nشكراً';
  static String createMessage = 'مرحباً فريق نبض ..\nأنا الطالب ()، رقمي الجامعي ()،مشترك في مبادرة نبض، يرجى تزويدي بكلمة المرور من أجل الدخول إلى تطبيق نبض\nشكراً';

  static String printServices(String name, String id){
    return 'خدمة الطباعة من شركة نبض ..\n\nمرحباً فريق نبض ..\n'
        'أنا الطالب $name,'
        ' رقمي الجامعي $id,'
        ' أريد طباعة بعض المحاضرات, وأريدها جاهزة (اليوم | غداً) في البولمانات, في رحلة (الذهاب | العودة) (من | إلى) الجامعة في تمام الساعة (), \nشكراً';
  }

  static String payPillServices(String name, String id){
    return  'خدمة تحويل الرصيد ودفع الفواتير من شركة نبض وBinary phone'
        ' ..\n\nمرحباً Binary phone ..\n'
        'أنا الطالب $name,'
        ' رقمي الجامعي $id,'
        'مشترك في مبادرة نبض, أريد (تحويل رصيد | دفع فاتورة) على رقمي التالي (), يرجى إعلامي بتكلفتها كي أقوم بتسديدها لفريق نبض في البولمانات (محمود موصللي) وشكراً';
  }

  static String examSessionServices(String name, String id){
    return  'خدمة الجلسات الامتحانية من شركة نبض ..\n\nمرحباً فريق نبض ..\n'
        'أنا الطالب $name,'
        ' رقمي الجامعي $id,'
        'أريد حضور جلسة امتحانية في مقرر (), وامتحاني في يوم (),\nوشكراً';
  }
}